{
  "init": "Hello,\n\nGood job with the assignment and congratulations on a good homework assignment! ",
  "finish": "\n\nGood job on your first project.\n\n-Respectfully, Central Grader YaeliB",
  "finishNormal": "\n\n-Respectfully, Central Grader YaeliB",
  "perfectMod1": "Hello,\n\nCongratulations on a good homework assignment! You were able to demonstrate your ability to refactor a web app with HTML and CSS. Good job deploying your application, you were able to correctly deploy to a live URL. Your application loads with minimal errors upon page load. You were able to submit your GitHub URL and your repo contains working organized code. You are using semantic html tags, there are alt tags in your images in the index.html file and the links are working. Also the css file is consolidated. The readme has a project description, screenshot, and deployment link.\n\nGood job.\n\n-Respectfully, Central Grader YaeliB",
  "perfectMod2": "Hello,\n\nGood job with the project. You were able to demonstrate your ability to create a professional profile. You are able to get the application deployed to Github pages and it loads with minimal errors. The application resembles the mock up functionality. You are following best practices for the file structure of the repo and naming conventions. Along with the best practices for class/id naming conventions, indentation. The readme has a project description, screenshot, and deployment link. Overall, good job with the project.\n\n-Respectfully, Central Grader YaeliB",
  "perfectMod3": "Hello,\n\nGood job with the project. You were able to demonstrate your ability to create a password generator application. You were also able to get the application deployed on Github pages. I am able to generate a password with the application and it prints the password onto the screen. You are following best practices for the file structure of the repo and naming conventions. Along with the best practices for class/id naming conventions, indentation. The readme has a project description, screenshot, and deployment link. Overall, good job with the project.\n\n-Respectfully, Central Grader YaeliB",
  "perfectMod4": "Hello,\n\nGood job with the assignment and congratulations on a good homework assignment! You were able to create a quiz made with javascript, css, and html that stores the scores into local storage. I am able to view the quiz on Github pages with the link that you supplied and take the quiz. At the end  of the quiz I can enter my initials and it saves my high score into local storage. You are following best practices for the file structure of the repo and naming conventions. Along with the best practices for class/id naming conventions, indentation. The readme has a project description, screenshot, and deployment link. Overall, good job with the project. \n\n-Respectfully, Central Grader YaeliB",
  "perfectMod5": "Hello,\n\nGood job with the project. You were able to demonstrate your ability to create a work day scheduler. You are able to get the application deployed to github pages and it loads with minimal errors. I can add entries into the scheduler and it saves them into localstorage. You are following best practices for the file structure of the repo and naming conventions. Along with the best practices for class/id naming conventions, indentation. The readme has a project description, screenshot, and deployment link. Overall, good job with the project. \n\n-Respectfully, Central Grader YaeliB",
  "perfectMod9": "Hello,\n\nGood job with the assignment and congratulations on a good homework assignment! You were able to successfully build a professional readme generator. I am able to clone and install the application and run it on my local machine. I can go through the prompts and it generates a readme. You also have supplied a sample readme that was generated with the application. You have a video walkthrough added to your readme that demonstrates the application. You are using the inquirer package in your project. You are following best practices for the file structure of the repo and naming conventions. Along with the best practices for class/id naming conventions, indentation. The readme has a project description. Overall, good job with the project. \n\n-Respectfully, Central Grader YaeliB",
  "perfectMod14": "Hello, \n\nGood job with the project. You were able to demonstrate your ability to create a tech-blog. You are following the model-view-controller paradigm. You are using the express handlebars package for your views and your application is deployed on Heroku. The application loads with little to no errors. The ui is easy to navigate, the interface style is clean and polished and resembles the mock-up functionality provided in the Challenge instructions. The readme has a project description, screenshot, and deployment link. Overall, good job with the project. \n\n-Respectfully, Central Grader YaeliB",
  "perfectMod19": "Hello,\n\nCongratulations on a good homework assignment! You were able to demonstrate your ability to create a progressive web application. Good job deploying your application, you were able to correctly deploy to a live URL. Your application loads with minimal errors upon page load. I can install the application and run it locally. I can write in the text editor and it saves the content that I write. When I refresh the page it displays the contents that I wrote from local storage. You were able to submit your GitHub URL and your repo contains working organized code. The readme has a project description, screenshot, and deployment link. Overall, good job with the project.\n\nGood job.\n\n-Respectfully, Central Grader YaeliB",
  "onlyRepoName": "The only thing points were taken off for is the repo name. You need to have an unique repo name.",
  "noSemanticTags": "The semantic tags are missing. The semantic tags need to replace the divs within the index.html file.",
  "noCss": "The css file is not consolidated. You have multiple selectors with the same code. You can consolidate the selectors to avoid repeated code.",
  "noProfReadme": "In the repo you need to have an professional readme. The professional readme needs to have a description, screenshot and deployment link. You can find more information on the professional readme here: https://coding-boot-camp.github.io/full-stack/github/professional-readme-guide.",
  "noUniqueRepoName": "The repo needs to have an unique name.",
  "noAssetsFolder": "In your repo you need to have an assets folder. In that assets folder thats where you need to have your script and css files at and in their own respective folders. ",
  "linkSemantic": "https://www.w3schools.com/html/html5_semantic_elements.asp",
  "linkProfessionalReadme": "https://coding-boot-camp.github.io/full-stack/github/professional-readme-guide",
  "linkSemanticCommit": "https://gist.github.com/joshbuchea/6f47e86d2510bce28f8e7f42ae84c716"
}