{
  "default": {
    "init": "Hello,\n\nGood job with the assignment and congratulations on a good homework assignment! ",
    "finish": "\n\n-Respectfully, Central Grader YaeliB",
    "skip": "Hello,\n\nIf you need help with your project you can reach out to the tutors or TA's for assistance. \n\n-Respectfully, Central Grader YaeliB",
    "noAssetsFolder": "In your repo you need to have an assets folder. In that assets folder thats where you need to have your script and css files at and in their own respective folders. ",
    "developFolder": "One thing about your repo, you still have the develop folder. Now that you are turning in your application, you don't need to have a develop folder anymore. All of the files that are in your develop folder should be in the root of your repo.",
    "badCommitHistory": "Your commit history is a bit sparse. Make sure that you commit every time that you make a meaningful change to the code and give it a message that describes the change that was made. Think of commits as a history of the development of your repository."
  },
  "mod1": {
    "perfect": "Hello,\n\nCongratulations on a good homework assignment! You were able to demonstrate your ability to refactor a web app with HTML and CSS. Good job deploying your application, you were able to correctly deploy to a live URL. Your application loads with minimal errors upon page load. You were able to submit your GitHub URL and your repo contains working organized code. You are using semantic html tags, there are alt tags in your images in the index.html file and the links are working. Also the css file is consolidated. The readme has a project description, screenshot, and deployment link.\n\n-Respectfully, Central Grader YaeliB",
    "rubric": {
      "Technical Acceptance Criteria": {
        "percentage": "40%",
        "criteria": [
          "Satisfies all of the above acceptance criteria."
        ]
      },
      "Deployment": {
        "percentage": "32%",
        "criteria": [
          "Application deployed at live URL.",
          "Application loads with no errors.",
          "Application GitHub URL submitted.",
          "GitHub repository contains application code."
        ]
      },
      "Application Quality": {
        "percentage": "15%",
        "criteria": [
          "Application resembles the mock-up functionality provided in the Challenge instructions."
        ]
      },
      "Repository Quality": {
        "percentage": "13%",
        "criteria": [
          "Repository has a unique name.",
          "Repository follows best practices for file structure and naming conventions.",
          "Repository follows best practices for class/id naming conventions, indentation, quality comments, etc.",
          "Repository contains multiple descriptive commit messages.",
          "Repository contains quality readme with description, screenshot, link to deployed application."
        ]
      },
      "Review": {
        "items": [
          "The URL of the deployed application.",
          "The URL of the GitHub repository that contains your code. Give the repository a unique name and include a README file that describes the project."
        ]
      }
    }
  },
  "mod2": []
}